alert("Програма виводить вcі прості числа з діапазону");
let n1=prompt("Введіть початок діапазону");
let n2=prompt("Введіть кінець діапазону");
for(let i=n1;i<=n2;++i){
    let flag=0;
    for(let j=2;j<=i/2;++j){
        if(i%j==0){
            flag=1;
            break;
        }
    }
    if(flag==0){
        alert(i);
    }
}

/*
Потрібно було виконати завдання використовуючи мітки; код з використанням міток:

alert("Програма виводить вcі прості числа з діапазону");
let n1=prompt("Введіть початок діапазону");
let n2=prompt("Введіть кінець діапазону");
flag:
for(let i=n1;i<=n2;++i){
    for(let j=2;j<=i/2;++j){
        if(i%j==0){
            continue flag;
        }
    }
    alert(i);
}
*/